{"class_name": "Model", "config": {"name": "model_2", "layers": [{"name": "Input-Token", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Input-Token"}, "inbound_nodes": []}, {"name": "Input-Segment", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null], "dtype": "float32", "sparse": false, "name": "Input-Segment"}, "inbound_nodes": []}, {"name": "Embedding-Token", "class_name": "Embedding", "config": {"name": "Embedding-Token", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 8021, "output_dim": 312, "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": true, "input_length": null}, "inbound_nodes": [[["Input-Token", 0, 0, {}]]]}, {"name": "Embedding-Segment", "class_name": "Embedding", "config": {"name": "Embedding-Segment", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 2, "output_dim": 312, "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["Input-Segment", 0, 0, {}]]]}, {"name": "Embedding-Token-Segment", "class_name": "Add", "config": {"name": "Embedding-Token-Segment", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Embedding-Token", 0, 0, {}], ["Embedding-Segment", 0, 0, {}]]]}, {"name": "Embedding-Position", "class_name": "PositionEmbedding", "config": {"name": "Embedding-Position", "trainable": true, "dtype": "float32", "input_dim": 512, "output_dim": 312, "merge_mode": "add", "hierarchical": null, "embeddings_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "custom_position_ids": false}, "inbound_nodes": [[["Embedding-Token-Segment", 0, 0, {}]]]}, {"name": "Embedding-Norm", "class_name": "LayerNormalization", "config": {"name": "Embedding-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Embedding-Position", 0, 0, {}]]]}, {"name": "Embedding-Dropout", "class_name": "Dropout", "config": {"name": "Embedding-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Embedding-Norm", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-0-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 26, "out_dim": 312, "key_size": 26, "use_bias": true, "attention_scale": true, "return_attention_scores": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Embedding-Dropout", 0, 0, {"a_bias": null}], ["Embedding-Dropout", 0, 0, {"a_bias": null}], ["Embedding-Dropout", 0, 0, {"a_bias": null}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Embedding-Dropout", 0, 0, {}], ["Transformer-0-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-0-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-0-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-0-FeedForward", "trainable": true, "dtype": "float32", "units": 1248, "activation": ["gelu_tanh"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-0-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-0-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-0-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-0-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-0-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-0-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-0-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-1-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 26, "out_dim": 312, "key_size": 26, "use_bias": true, "attention_scale": true, "return_attention_scores": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-0-FeedForward-Norm", 0, 0, {"a_bias": null}], ["Transformer-0-FeedForward-Norm", 0, 0, {"a_bias": null}], ["Transformer-0-FeedForward-Norm", 0, 0, {"a_bias": null}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-0-FeedForward-Norm", 0, 0, {}], ["Transformer-1-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-1-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-1-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-1-FeedForward", "trainable": true, "dtype": "float32", "units": 1248, "activation": ["gelu_tanh"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-1-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-1-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-1-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-1-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-1-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-1-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-1-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-FeedForward-Add", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention", "class_name": "MultiHeadAttention", "config": {"name": "Transformer-2-MultiHeadSelfAttention", "trainable": true, "dtype": "float32", "heads": 12, "head_size": 26, "out_dim": 312, "key_size": 26, "use_bias": true, "attention_scale": true, "return_attention_scores": false, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-1-FeedForward-Norm", 0, 0, {"a_bias": null}], ["Transformer-1-FeedForward-Norm", 0, 0, {"a_bias": null}], ["Transformer-1-FeedForward-Norm", 0, 0, {"a_bias": null}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Add", "class_name": "Add", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-1-FeedForward-Norm", 0, 0, {}], ["Transformer-2-MultiHeadSelfAttention-Dropout", 0, 0, {}]]]}, {"name": "Transformer-2-MultiHeadSelfAttention-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-2-MultiHeadSelfAttention-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Add", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward", "class_name": "FeedForward", "config": {"name": "Transformer-2-FeedForward", "trainable": true, "dtype": "float32", "units": 1248, "activation": ["gelu_tanh"], "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Norm", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Dropout", "class_name": "Dropout", "config": {"name": "Transformer-2-FeedForward-Dropout", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["Transformer-2-FeedForward", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Add", "class_name": "Add", "config": {"name": "Transformer-2-FeedForward-Add", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["Transformer-2-MultiHeadSelfAttention-Norm", 0, 0, {}], ["Transformer-2-FeedForward-Dropout", 0, 0, {}]]]}, {"name": "Transformer-2-FeedForward-Norm", "class_name": "LayerNormalization", "config": {"name": "Transformer-2-FeedForward-Norm", "trainable": true, "dtype": "float32", "center": true, "scale": true, "epsilon": 1e-12, "conditional": false, "hidden_units": null, "hidden_activation": "linear", "hidden_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}}, "inbound_nodes": [[["Transformer-2-FeedForward-Add", 0, 0, {}]]]}, {"name": "CLS-token", "class_name": "Lambda", "config": {"name": "CLS-token", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAMAAABDAAAAcxAAAAB8AGQAZACFAmQBZgIZAFMAKQJO6QAAAACpACkB2gF4\ncgIAAAByAgAAAPojL3RtcC9pcHlrZXJuZWxfMTY0NzMzLzIxNTU4OTkxMDIucHnaCDxsYW1iZGE+\nCQAAAPMAAAAA\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["Transformer-2-FeedForward-Norm", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_5", "class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_6", "class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_7", "class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_8", "class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_9", "class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_10", "class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_11", "class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_12", "class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_13", "class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_14", "class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_15", "class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_17", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_18", "class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_19", "class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "dropout_20", "class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "dtype": "float32", "rate": 0.1, "noise_shape": null, "seed": null}, "inbound_nodes": [[["CLS-token", 0, 0, {}]]]}, {"name": "preds_0", "class_name": "Dense", "config": {"name": "preds_0", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "preds_1", "class_name": "Dense", "config": {"name": "preds_1", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "preds_2", "class_name": "Dense", "config": {"name": "preds_2", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "preds_3", "class_name": "Dense", "config": {"name": "preds_3", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "preds_4", "class_name": "Dense", "config": {"name": "preds_4", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"name": "preds_5", "class_name": "Dense", "config": {"name": "preds_5", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"name": "preds_6", "class_name": "Dense", "config": {"name": "preds_6", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"name": "preds_7", "class_name": "Dense", "config": {"name": "preds_7", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"name": "preds_8", "class_name": "Dense", "config": {"name": "preds_8", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"name": "preds_9", "class_name": "Dense", "config": {"name": "preds_9", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"name": "preds_10", "class_name": "Dense", "config": {"name": "preds_10", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"name": "preds_11", "class_name": "Dense", "config": {"name": "preds_11", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"name": "preds_12", "class_name": "Dense", "config": {"name": "preds_12", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"name": "preds_13", "class_name": "Dense", "config": {"name": "preds_13", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"name": "preds_14", "class_name": "Dense", "config": {"name": "preds_14", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}, {"name": "preds_15", "class_name": "Dense", "config": {"name": "preds_15", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"name": "preds_16", "class_name": "Dense", "config": {"name": "preds_16", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"name": "preds_17", "class_name": "Dense", "config": {"name": "preds_17", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"name": "preds_18", "class_name": "Dense", "config": {"name": "preds_18", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_19", 0, 0, {}]]]}, {"name": "preds_19", "class_name": "Dense", "config": {"name": "preds_19", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "TruncatedNormal", "config": {"mean": 0.0, "stddev": 0.02, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_20", 0, 0, {}]]]}], "input_layers": [["Input-Token", 0, 0], ["Input-Segment", 0, 0]], "output_layers": [["preds_0", 0, 0], ["preds_1", 0, 0], ["preds_2", 0, 0], ["preds_3", 0, 0], ["preds_4", 0, 0], ["preds_5", 0, 0], ["preds_6", 0, 0], ["preds_7", 0, 0], ["preds_8", 0, 0], ["preds_9", 0, 0], ["preds_10", 0, 0], ["preds_11", 0, 0], ["preds_12", 0, 0], ["preds_13", 0, 0], ["preds_14", 0, 0], ["preds_15", 0, 0], ["preds_16", 0, 0], ["preds_17", 0, 0], ["preds_18", 0, 0], ["preds_19", 0, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}